/*****************************************************************//**
 * @file	main.h
 * @brief	定数の外部定義
 * 
 * @details	
 * 
 * ------------------------------------------------------------
 * @author	Iwai Shogo
 * ------------------------------------------------------------
 * 
 * @date	2025/11/23	初回作成日
 * 			作業内容：	- 追加：
 * 
 * @update	2025/xx/xx	最終更新日
 * 			作業内容：	- XX：
 * 
 * @note	（省略可）
 *********************************************************************/

#ifndef ___MAIN_H___
#define ___MAIN_H___

// ===== インクルード =====
#include "Engine/Config.h"	// Engine側の定義を使用

#endif // !___MAIN_H___
